//: Playground - noun: a place where people can play

import UIKit

/*******************************************************
*
*   [ Swift ] 運算子 - 算數運算子
*
*******************************************************/

/*******************************************************
*
*   算數運算子 -> 一元運算子 +
*
*******************************************************/

var operand1 = 10, operand2 = 5, result:Int

result = +operand1

print("result: \(result)")

/*******************************************************
*
*   算數運算子 -> 一元運算子 -
*
*******************************************************/

result = -operand1

print("result: \(result)")

/*******************************************************
*
*   算數運算子 -> 二元運算子 +
*
*******************************************************/

result = operand1 + operand2

print("\(operand1) + \(operand2) = \(result)")

/*******************************************************
*
*   算數運算子 -> 二元運算子 -
*
*******************************************************/

result = operand1 - operand2

print("\(operand1) - \(operand2) = \(result)")

/*******************************************************
*
*   算數運算子 -> 二元運算子 *
*
*******************************************************/

result = operand1 * operand2

print("\(operand1) * \(operand2) = \(result)")

/*******************************************************
*
*   算數運算子 -> 二元運算子 /
*
*******************************************************/

result = operand1 / operand2

print("\(operand1) / \(operand2) = \(result)")

/*******************************************************
*
*   算數運算子 -> 二元運算子 %
*
*******************************************************/

result = operand1 % operand2

print("\(operand1) % \(operand2) = \(result)")

/*******************************************************
*
*   算數運算子 -> 遞增遞減運算子 ＋＋(前置)
*
*******************************************************/

var operand3 = 10

print("\(operand3) => \(operand3)")

print("++\(operand3) => \(++operand3)")

print("\(operand3) => \(operand3)")

/*******************************************************
*
*   算數運算子 -> 遞增遞減運算子 --(前置)
*
*******************************************************/

var operand4 = 10

print("\(operand4) => \(operand4)")

print("--\(operand4) => \(--operand4)")

print("\(operand4) => \(operand4)")

/*******************************************************
*
*   算數運算子 -> 遞增遞減運算子 ＋＋(後置)
*
*******************************************************/

var operand5 = 10

print("\(operand5) => \(operand5)")

print("\(operand5)++ => \(operand5++)")

print("\(operand5) => \(operand5)")

/*******************************************************
*
*   算數運算子 -> 遞增遞減運算子 --(後置)
*
*******************************************************/

var operand6 = 10

print("\(operand6) => \(operand6)")

print("\(operand6)-- => \(operand6--)")

print("\(operand6) => \(operand6)")
