//: Playground - noun: a place where people can play

import UIKit

/*******************************************************
*
*   [ Swift ] 運算子 - 關係運算子
*
*******************************************************/

/*******************************************************
*
*   關係運算子 -> <
*
*******************************************************/

var operand1 = 10, operand2 = 20

if operand1 < operand2 {
    print("\(operand1) < \(operand2)")
}else{
    print("\(operand1) >= \(operand2)")
}

/*******************************************************
*
*   關係運算子 -> >
*
*******************************************************/

if operand1 > operand2 {
    print("\(operand1) > \(operand2)")
}else{
    print("\(operand1) <= \(operand2)")
}

/*******************************************************
*
*   關係運算子 -> <=
*
*******************************************************/

if operand1 <= operand2 {
    print("\(operand1) <= \(operand2)")
}else{
    print("\(operand1) > \(operand2)")
}

/*******************************************************
*
*   關係運算子 -> >=
*
*******************************************************/

if operand1 >= operand2 {
    print("\(operand1) >= \(operand2)")
}else{
    print("\(operand1) < \(operand2)")
}

/*******************************************************
*
*   關係運算子 -> ==
*
*******************************************************/

if operand1 == operand2 {
    print("\(operand1) == \(operand2)")
}else{
    print("\(operand1) != \(operand2)")
}

/*******************************************************
*
*   關係運算子 -> !=
*
*******************************************************/

if operand1 != operand2 {
    print("\(operand1) != \(operand2)")
}else{
    print("\(operand1) == \(operand2)")
}

